OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f1571.h
extern __at(0x0D9E) volatile __PWM1CLKCONbits_t PWM1CLKCONbits;

#define _PWM1CLKCON_PWM1CS0     0x01
#define _PWM1CLKCON_CS0         0x01
#define _PWM1CLKCON_PWM1CS1     0x02
#define _PWM1CLKCON_CS1         0x02
#define _PWM1CLKCON_PWM1PS0     0x10
#define _PWM1CLKCON_PS0         0x10
#define _PWM1CLKCON_PWM1PS1     0x20
#define _PWM1CLKCON_PS1         0x20
#define _PWM1CLKCON_PWM1PS2     0x40
#define _PWM1CLKCON_PS2         0x40

//==============================================================================


//==============================================================================
//        PWM1LDCON Bits

extern __at(0x0D9F) __sfr PWM1LDCON;

typedef union
  {
  struct
    {
    unsigned PWM1LDS0           : 1;
    unsigned PWM1LDS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LDT                : 1;
    unsigned LDA                : 1;
    };

  struct
    {
    unsigned LDS0               : 1;
    unsigned LDS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM1LDM            : 1;
    unsigned PWM1LD             : 1;
    };

  struct
    {
    unsigned PWM1LDS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned LDS                : 2;
    unsigned                    : 6;
    };
  } __PWM1LDCONbits_t;

extern __at(0x0D9F) volatile __PWM1LDCONbits_t PWM1LDCONbits;

#define _PWM1LDS0               0x01
#define _LDS0                   0x01
#define _PWM1LDS1               0x02
#define _LDS1                   0x02
#define _LDT                    0x40
#define _PWM1LDM                0x40
#define _LDA                    0x80
#define _PWM1LD                 0x80

//==============================================================================


//==============================================================================
//        PWM1OFCON Bits

extern __at(0x0DA0) __sfr PWM1OFCON;

typedef union
  {
  struct
    {
    unsigned PWM1OFS0           : 1;
    unsigned PWM1OFS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OFO                : 1;
    unsigned PWM1OFM0           : 1;
    unsigned PWM1OFM1           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS0               : 1;
    unsigned OFS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM1OFMC           : 1;
    unsigned OFM0               : 1;
    unsigned OFM1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM1OFS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 5;
    unsigned OFM                : 2;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWM1OFM            : 2;
    unsigned                    : 1;
    };
  } __PWM1OFCONbits_t;

extern __at(0x0DA0) volatile __PWM1OFCONbits_t PWM1OFCONbits;

#define _PWM1OFS0               0x01
#define _OFS0                   0x01
#define _PWM1OFS1               0x02
#define _OFS1                   0x02
#define _OFO                    0x10
#define _PWM1OFMC               0x10
#define _PWM1OFM0               0x20
#define _OFM0                   0x20
#define _PWM1OFM1               0x40
#define _OFM1                   0x40

//==============================================================================

extern __at(0x0DA1) __sfr PWM2PH;

//==============================================================================
//        PWM2PHL Bits

extern __at(0x0DA1) __sfr PWM2PHL;

typedef struct
  {
  unsigned PWM2PHL0             : 1;
  unsigned PWM2PHL1             : 1;
  unsigned PWM2PHL2             : 1;
  unsigned PWM2PHL3             : 1;
  unsigned PWM2PHL4             : 1;
  unsigned PWM2PHL5             : 1;
  unsigned PWM2PHL6             : 1;
  unsigned PWM2PHL7             : 1;
  } __PWM2PHLbits_t;

extern __at(0x0DA1) volatile __PWM2PHLbits_t PWM2PHLbits;

#define _PWM2PHL0               0x01
#define _PWM2PHL1               0x02
#define _PWM2PHL2               0x04
#define _PWM2PHL3               0x08
#define _PWM2PHL4               0x10
#define _PWM2PHL5               0x20
#define _PWM2PHL6               0x40
#define _PWM2PHL7               0x80

//==============================================================================


//==============================================================================
//        PWM2PHH Bits

extern __at(0x0DA2) __sfr PWM2PHH;

typedef struct
  {
  unsigned PWM2PHH0             : 1;
  unsigned PWM2PHH1             : 1;
  unsigned PWM2PHH2             : 1;
  unsigned PWM2PHH3             : 1;
  unsigned PWM2PHH4             : 1;
  unsigned PWM2PHH5             : 1;
  unsigned PWM2PHH6             : 1;
  unsigned PWM2PHH7             : 1;
  } __PWM2PHHbits_t;

extern __at(0x0DA2) volatile __PWM2PHHbits_t PWM2PHHbits;

#define _PWM2PHH0               0x01
#define _PWM2PHH1               0x02
#define _PWM2PHH2               0x04
#define _PWM2PHH3               0x08
#define _PWM2PHH4               0x10
#define _PWM2PHH5               0x20
#define _PWM2PHH6               0x40
#define _PWM2PHH7               0x80

//==============================================================================

extern __at(0x0DA3) __sfr PWM2DC;

//==============================================================================
//        PWM2DCL Bits

extern __at(0x0DA3) __sfr PWM2DCL;

typedef struct
  {
  unsigned PWM2DCL0             : 1;
  unsigned PWM2DCL1             : 1;
  unsigned PWM2DCL2             : 1;
  unsigned PWM2DCL3             : 1;
  unsigned PWM2DCL4             : 1;
  unsigned PWM2DCL5             : 1;
  unsigned PWM2DCL6             : 1;
  unsigned PWM2DCL7             : 1;
  } __PWM2DCLbits_t;

extern __at(0x0DA3) volatile __PWM2DCLbits_t PWM2DCLbits;

#define _PWM2DCL0               0x01
#define _PWM2DCL1               0x02
#define _PWM2DCL2               0x04
#define _PWM2DCL3               0x08
#define _PWM2DCL4               0x10
#define _PWM2DCL5               0x20
#define _PWM2DCL6               0x40
#define _PWM2DCL7               0x80

//==============================================================================


//==============================================================================
//        PWM2DCH Bits

extern __at(0x0DA4) __sfr PWM2DCH;

typedef struct
  {
  unsigned PWM2DCH0             : 1;
  unsigned PWM2DCH1             : 1;
  unsigned PWM2DCH2             : 1;
  unsigned PWM2DCH3             : 1;
  unsigned PWM2DCH4             : 1;
  unsigned PWM2DCH5             : 1;
  unsigned PWM2DCH6             : 1;
  unsigned PWM2DCH7             : 1;
  } __PWM2DCHbits_t;

extern __at(0x0DA4) volatile __PWM2DCHbits_t PWM2DCHbits;

#define _PWM2DCH0               0x01
#define _PWM2DCH1               0x02
#define _PWM2DCH2               0x04
#define _PWM2DCH3               0x08
#define _PWM2DCH4               0x10
#define _PWM2DCH5               0x20
#define _PWM2DCH6               0x40
#define _PWM2DCH7               0x80

//==============================================================================

